In [1]:
import  psycopg2

connect to the database

In [2]:
conn = psycopg2.connect(database="company", user="postgres", password="root", host = "127.0.0.1", port ="5433")
print("Opened database successfully")

Opened database successfully

create Table

cur= conn.cursor()
cur.execute('''CREATE TABLE EMPLOYEES
(ID   INT        PRIMARY KEY,
 NAME       TEXT    NOT NULL,
 AGE        INT         NOT NULL,
 SALARY     REAL            );''')

print("Table created successfully")

conn.commit()

In [34]:
conn = psycopg2.connect(database="company", user="postgres", password="root", host = "127.0.0.1", port ="5433")
cur= conn.cursor()
cur.execute("INSERT INTO EMPLOYEES (ID,NAME,AGE,SALARY) VALUES (4, 'Mahnoud ', 36, 2000.00 )");
cur.execute("INSERT INTO EMPLOYEES (ID,NAME,AGE,SALARY) VALUES (5, 'Sara', 33, 3000.00 )");
cur.execute("INSERT INTO EMPLOYEES (ID,NAME,AGE,SALARY) VALUES (6, 'Eman',44, 4000.00 )");
conn.commit()
print("Records created successfully")

Records created successfully

In [19]:
conn = psycopg2.connect(database="school", user="postgres", password="root", host = "127.0.0.1", port ="5433")
cur = conn.cursor()
cur.execute("SELECT id, name,  salary from EMPLOYEES")
rows = cur.fetchall()
for row in rows:
    print("ID = ", row[0])
    print("NAME =", row[1])
    print("SALARY = ", row[2], "\n")
print("Operation done successfully")

ID =  4
NAME = Mahnoud
SALARY =  2000.0

ID =  5
NAME = Sara
SALARY =  3000.0

ID =  6
NAME = Eman
SALARY =  4000.0

Operation done successfully

In [19]:
conn = psycopg2.connect(database="school", user="postgres", password="root", host = "127.0.0.1", port ="5433")
cur = conn.cursor()
cur.execute("SELECT id, name,  salary from EMPLOYEES")
rows = cur.fetchall()
for row in rows:
    print("ID = ", row[0])
    print("NAME =", row[1])
    print("SALARY = ", row[2], "\n")
print("Operation done successfully")

ID =  4
NAME = Mahnoud
SALARY =  2000.0

ID =  5
NAME = Sara
SALARY =  3000.0

ID =  6
NAME = Eman
SALARY =  4000.0

Operation done successfully

In [35]:
conn = psycopg2.connect(database="company", user="postgres", password="root", host = "127.0.0.1", port ="5433")
cur=conn.cursor()
cur.execute("UPDATE EMPLOYEES set SALARY = 25000.00 where ID=6 ")
conn.commit()
cur.execute("SELECT id, name,  salary from EMPLOYEES")
rows = cur.fetchall()
for row in rows:
    print("ID =", row[0])
    print("NAME =", row[1])
    print("SALARY =", row[2], "\n")
print("Operation done successfully")

ID = 4
NAME = Mahnoud
SALARY = 2000.0

ID = 5
NAME = Sara
SALARY = 3000.0

ID = 6
NAME = Eman
SALARY = 25000.0

Operation done successfully

In [36]:
conn = psycopg2.connect(database="company", user="postgres", password="root", host = "127.0.0.1", port ="5433")
cur=conn.cursor()
cur.execute("DELETE  from EMPLOYEES where  ID=4;")
conn.commit()
print("Total number of rows deleted :", cur.rowcount)
cur.execute("SELECT id, name, salary from EMPLOYEES")
rows= cur.fetchall()
for row in rows:
    print("ID=" ,row[0])
    print("NAME=",row[1])
    print("SALARY =", row[2], "\n")
print("Operation done successfully")

Total number of rows deleted : 1
ID= 5
NAME= Sara
SALARY = 3000.0

ID= 6
NAME= Eman
SALARY = 25000.0

Operation done successfully

In [5]:
import psycopg2

conn = psycopg2.connect(database="company", user="postgres", password="root", host = "127.0.0.1", port ="5433")
print("Opened database successfully")

# Create a cursor object to execute SQL commands
cur = conn.cursor()

# Create TableA
cur.execute('''
    CREATE TABLE TableA (
        id serial PRIMARY KEY,
        name VARCHAR(255) NOT NULL
    )
''')

# Create TableB with a foreign key reference to TableA
cur.execute('''
    CREATE TABLE TableB (
        id serial PRIMARY KEY,
        tablea_id INTEGER REFERENCES TableA(id),
        value VARCHAR(255) NOT NULL
    )
''')


conn.commit()
cur.close()
conn.close()

Opened database successfully

DuplicateTable: relation "tablea" already exists